<?php
/**
 * Создайте класс GuestBook, который будет удовлетворять следующим требованиям:
 *
 * 1.В конструктор передается путь до файла с данными гостевой книги, в нём же происходит чтение данных
 *   из ней (используйте защищенное свойство объекта для хранения данных)
 * 2.Метод getData() возвращает массив записей гостевой книги
 * 3.Метод append($text) добавляет новую запись к массиву записей
 * 4.Метод save() сохраняет массив в файл
 */

require_once __DIR__ . '/TextFile.php';

class GuestBook extends TextFile
{
    //
    public function append($text)
    {
        $this->data_read_from_file[] = $text;

    }
}
